Feature:Електронен дневник

  Scenario: Успешно вписване на оценка на ученик
    Given Започва да въвежда оценка
    When Избира ученик: "Мартин Христов"
    And Избира предмет: "Физическо"
    And Въвежда оценката: "6"
    And Натиска бутона за въвеждане
    Then Вижда съобщение: "Успешен запис на оценка!"

  Scenario: Успешна проверка на оценка
    Given Започва проверка на оценката
    When Избира ученик: "Мартин Христов"
    And Избира предмет: "Физическо"
    And Натиска бутона за проверка
    Then Вижда съобщение: "Оценката е: 6"

  Scenario: Неуспешно вписване на оценка на ученик поради това, че оценката не е между 2 и 6
    Given Започва да въвежда оценка
    When Избира ученик: "Мартин Христов"
    And Избира предмет: "Физическо"
    And Въвежда оценката: "8"
    And Натиска бутона за въвеждане
    Then Вижда съобщение: "Въведете оценка между 2-6"

  Scenario: Неуспешно вписване на оценка на ученик, защото не учи този предмет
    Given Започва да въвежда оценка
    When Избира ученик: "Мартин Христов"
    And Избира предмет: "Немски"
    And Въвежда оценката: "5"
    And Натиска бутона за въвеждане
    Then Вижда съобщение: "Ученикът не учи този предмет"

  Scenario: Неуспешна проверка на оценка поради това, че ученикът не учи този предмет
    Given Започва проверка на оценката
    When Избира ученик: "Мартин Христов"
    And Избира предмет: "Немски"
    And Натиска бутона за проверка
    Then Вижда съобщение: "Ученикът не учи този предмет"



